In [1]:
%load_ext sql

In [2]:
%sql sqlite://

['ALL', 'DEFAULT', 'DOUBLE_BORDER', 'FRAME', 'HEADER', 'MARKDOWN', 'MSWORD_FRIENDLY', 'NONE', 'ORGMODE', 'PLAIN_COLUMNS', 'RANDOM', 'SINGLE_BORDER']

In [4]:
%%sql

CREATE TABLE sectors (
    sector_id INTEGER PRIMARY KEY,
    sector_name TEXT
);

CREATE TABLE stocks (
    stock_id INTEGER PRIMARY KEY,
    stock_name TEXT,
    sector_id INTEGER,
    price INTEGER
);

 * sqlite://
Done.
Done.

[]

In [5]:
%config SqlMagic.style = 'DEFAULT'

In [6]:
%%sql

INSERT INTO sectors VALUES (101, 'Technology'), (102, 'Banking'), (103, 'IT Services'), (104, 'Pharma');

INSERT INTO stocks VALUES
(1, 'AAPL', 101, 180),
(2, 'MSFT', 101, 320),
(3, 'JPM', 102, 150),
(4, 'TCS', 103, 3500),
(5, 'INFY', 103, 1450);

 * sqlite://
4 rows affected.
5 rows affected.

[]

In [7]:
%%sql
SELECT s.stock_name, s.price, sec.sector_name
FROM stocks s
JOIN sectors sec ON s.sector_id = sec.sector_id;

 * sqlite://
Done.

[('AAPL', 180, 'Technology'),
 ('MSFT', 320, 'Technology'),
 ('JPM', 150, 'Banking'),
 ('TCS', 3500, 'IT Services'),
 ('INFY', 1450, 'IT Services')]

##########################

In [8]:


%%sql



CREATE TABLE customers (
    customer_id INT PRIMARY KEY,
    name VARCHAR(30),
    city VARCHAR(30)
);

INSERT INTO customers (customer_id, name, city) VALUES
(1, "Asha Rao", "Mumbai"),
(2, "Ravi Shah", "Delhi"),
(3, "Neha Jain", "Pune"),
(4, "Karan Das", "Chennai");




CREATE TABLE transactions (
    txn_id INT PRIMARY KEY,
    customer_id INT,
    txn_date DATE,
    amount INT
);

INSERT INTO transactions (txn_id, customer_id, txn_date, amount) VALUES
(101, 1, "2024-06-01", 1200),
(102, 1, "2024-06-03", 2200),
(103, 2, "2024-06-01", 500),
(104, 3, "2024-06-02", 0);

 * sqlite://
Done.
4 rows affected.
Done.
4 rows affected.

[]

In [12]:
## Problem 1 : Total txn per customer

In [19]:
%%sql

SELECT name, SUM(amount)
FROM customers
JOIN transactions ON customers.customer_id = transactions.customer_id
GROUP BY customers.name
ORDER BY amount ;

 * sqlite://
Done.

[('Neha Jain', 0), ('Ravi Shah', 500), ('Asha Rao', 3400)]

In [27]:
%%sql

SELECT name, txn_id
FROM customers
LEFT JOIN transactions ON 
customers.customer_id = transactions.customer_id
WHERE transactions.txn_id IS NULL

 * sqlite://
Done.

[('Karan Das', None)]

In [10]:
%%sql

SELECT *
FROM customers

 * sqlite://
Done.

[(1, 'Asha Rao', 'Mumbai'),
 (2, 'Ravi Shah', 'Delhi'),
 (3, 'Neha Jain', 'Pune'),
 (4, 'Karan Das', 'Chennai')]

In [11]:
%%sql

SELECT *
FROM transactions

 * sqlite://
Done.

[(101, 1, '2024-06-01', 1200),
 (102, 1, '2024-06-03', 2200),
 (103, 2, '2024-06-01', 500),
 (104, 3, '2024-06-02', 0)]

In [20]:
## Problem 2 : customers with no txns

In [28]:
##  Problem 3: Find the city with the highest total transaction amount

In [37]:
%%sql

SELECT city, SUM(amount) as total_txn
FROM customers
JOIN transactions ON 
customers.customer_id = transactions.customer_id
GROUP BY customers.city
ORDER BY SUM(amount) DESC
LIMIT 1;

 * sqlite://
Done.

[('Mumbai', 3400)]

In [38]:
%%sql

CREATE TABLE funds(
    fund_id INT PRIMARY KEY,
    fund_name VARCHAR (20),
    category VARCHAR (20)
);

INSERT INTO funds (fund_id, fund_name, category) VALUES
(1, 'Alpha Growth Fund', 'Equity'),
(2, 'Secure Yield Fund', 'Debt'),
(3, 'Future Tech Fund', 'Tech-Focused'),
(4, 'Green ESG Fund', 'ESG');


CREATE TABLE investments(
    invest_id INT PRIMARY KEY,
    fund_id INT,
    investor_name VARCHAR (10),
    amount_invested INT,
    date DATE
);

INSERT INTO investments (invest_id, fund_id, investor_name, amount_invested, date) VALUES
(101, 1, 'Raj', 100000, '2024-01-01'),
(102, 2, 'Mira', 50000, '2024-01-15'),
(103, 1, 'Akash', 75000, '2024-02-01'),
(104, 3, 'Raj', 120000, '2024-03-01'),
(105, 2, 'Neha', 60000, '2024-04-01'),
(106, 4, 'Akash', 25000, '2024-04-15');

 * sqlite://
Done.
4 rows affected.
Done.
6 rows affected.

[]

In [42]:
##    Problem 1: Total funds raised per fund

In [46]:
%%sql

SELECT fund_name, SUM(amount_invested)
FROM funds
INNER JOIN investments 
ON funds.fund_id = investments.fund_id
GROUP BY fund_name

 * sqlite://
Done.

[('Alpha Growth Fund', 175000),
 ('Future Tech Fund', 120000),
 ('Green ESG Fund', 25000),
 ('Secure Yield Fund', 110000)]

In [47]:
##   Problem 2: List investors who have invested in more than one fund

In [52]:
%%sql

SELECT investor_name, COUNT(DISTINCT fund_id)
FROM investments
GROUP BY investor_name
HAVING COUNT(DISTINCT fund_id) > 1

 * sqlite://
Done.

[('Akash', 2), ('Raj', 2)]

In [53]:
##  Problem 3: Find the top fund category by total amount raised

In [56]:
%%sql

SELECT category, SUM(amount_invested)
FROM funds
INNER JOIN investments 
ON funds.fund_id = investments.fund_id
GROUP BY category
ORDER BY SUM(amount_invested) DESC
LIMIT 1;

 * sqlite://
Done.

[('Equity', 175000)]

In [40]:
%%sql

SELECT *
FROM funds

 * sqlite://
Done.

[(1, 'Alpha Growth Fund', 'Equity'),
 (2, 'Secure Yield Fund', 'Debt'),
 (3, 'Future Tech Fund', 'Tech-Focused'),
 (4, 'Green ESG Fund', 'ESG')]

In [41]:
%%sql

SELECT *
FROM investments

 * sqlite://
Done.

[(101, 1, 'Raj', 100000, '2024-01-01'),
 (102, 2, 'Mira', 50000, '2024-01-15'),
 (103, 1, 'Akash', 75000, '2024-02-01'),
 (104, 3, 'Raj', 120000, '2024-03-01'),
 (105, 2, 'Neha', 60000, '2024-04-01'),
 (106, 4, 'Akash', 25000, '2024-04-15')]

In [57]:
##    Problem 4: Funds with no investments yet

In [63]:
%%sql

SELECT fund_name
FROM funds
LEFT JOIN investments 
ON funds.fund_id = investments.fund_id
WHERE invest_id IS NULL

 * sqlite://
Done.

[]